PaymentGatewayTaskDispatcher/src/test/resources/findTransactionForNotificationTest.json

[
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESULT_RECEIVED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 0,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": null,
    "notificationExecutionStartTime": null
  },
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_UNRECOVERABLE_FAILED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 0,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": null,
    "notificationExecutionStartTime": null
  },




  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_TIMEOUT",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 4,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "2021-07-04T14:36:16.651Z",
    "notificationExecutionStartTime": "2021-07-04T14:36:16.651Z"
  },
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_UNRECOVERABLE_FAILED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 4,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "2021-07-04T14:36:16.651Z",
    "notificationExecutionStartTime": "2021-07-04T14:36:16.651Z"
  },
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_TIMEOUT",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 9,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "2021-07-04T14:36:16.651Z",
    "notificationExecutionStartTime": "2021-07-04T14:36:16.651Z"
  },
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_TIMEOUT",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 4,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "3000-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "notificationExecutionStartTime": "3000-07-05T11:52:20.110Z"
  },





  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_TECHNICAL_FAILED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 1,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "2021-07-04T14:36:16.651Z",
    "notificationExecutionStartTime": "2021-07-04T14:36:16.651Z"
  },
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_UNRECOVERABLE_FAILED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 1,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "2021-07-04T14:36:16.651Z",
    "notificationExecutionStartTime": "2021-07-04T14:36:16.651Z"
  },
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_TECHNICAL_FAILED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 10,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "2021-07-04T14:36:16.651Z",
    "notificationExecutionStartTime": "3000-07-04T14:36:16.651Z"
  },
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_TECHNICAL_FAILED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 1,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "2021-07-04T14:36:16.651Z",
    "notificationExecutionStartTime": "3000-07-04T14:36:16.651Z"
  }
]