PaymentGatewayTaskDispatcher/src/test/resources/findTransactionForNotificationUnclaimTest.json

[
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_EXECUTION_CLAIMED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 0,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "2021-07-04T14:36:16.651Z",
    "notificationExecutionStartTime": null
  },
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "PAYMENT_REQUEST_UNRECOVERABLE_FAILED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 0,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": null,
    "notificationExecutionStartTime": null
  },
  {
    "transactionDetails": {
      "debitAccountNumber": "0123456789",
      "creditAccountNumber": "9876543210",
      "amount": "10.0",
      "currency": "HKD",
      "paymentMethod": "CREDIT_CARD",
      "paymentResult": "SUCCESSFUL",
      "receiveTime": "2021-07-03T15:20:58.712Z",
      "transactionCompleteTime": "2021-07-03T15:20:58.712Z"
    },
    "executionState": "RESPONSE_SENDING_EXECUTION_CLAIMED",
    "paymentAttempts": 0,
    "notificationSendingAttempts": 10,
    "callbackUri": "http://localhost:8080/api/record",
    "paymentDispatchClaimTime": "2021-07-05T11:52:20.110Z",
    "paymentExecutionStartTime": "2021-07-04T14:36:16.651Z",
    "notificationDispatchClaimTime": "3000-07-04T14:36:16.651Z",
    "notificationExecutionStartTime": null
  }
]